; (NB!) Формат комментариев: Коментарий по-русски (Comment in English)
; UTF-16 LЕ with ВОМ

[Variables]
_Name=OmniCal
_Version=v3.5

; Выбор ЯЗЫКа интерфейса  (Language choice of the interface):
    ; Варианты (Options): RU, EN
    Language=EN

    ;—— ПОДПИСИ (Labels) ————————————————————————————————————————————————————————————————————————————————
    Version_txt_RU=#_Name# #_Version#
    Version_txt_EN=OmniCal #_Version#

    CurentTime_RU="Текущее время"
    CurentTime_EN="Current time"

    HighlightToday_RU="Выделить Сегодня"
    HighlightToday_EN="Highlight Today"

    DateinToday_txt_RU="Дата Сегодня"
    DateinToday_txt_EN="Date in Today"

    TimeZone_1_RU="Зоны времени"
    TimeZone_1_EN="Time Zones"

    TimeSeparator_1_txt_RU="Разделители"
    TimeSeparator_1_txt_EN="Time Separators"

    Weekend_txt_RU="Выходные"
    Weekend_txt_EN="Weekend"
    Weekend_Days_txt_RU="Пн    Вт    Ср     Чт    Пт    Сб    Вс"
    Weekend_Days_txt_EN="Mo    Tu    We     Th    Fr    Sa    Su"

    StepGrid_txt_RU="Шаг сетки#CRLF#(высота получаса)"
    StepGrid_txt_EN="Half-hour height#CRLF#(Step of the grid)"

    DisplayedDays_txt_RU="Количество дней#CRLF#( 1 - 14 )"
    DisplayedDays_txt_EN="Number of days#CRLF#( 1 - 14 )"

    ToDay_Width_txt_RU="Сегодня"
    ToDay_Width_txt_EN="Today"

    OthersDay_Width_txt_RU="Остальные"
    OthersDay_Width_txt_EN="Other"

    _Author=⊰SK⊱
    _Information_RU=Отображает предстоящие события из ваших Google или iCloud Календарей.    Этот скин является адаптированной модификацией оригинального патча от eclectic-tech (на основе Enigma GCal от Kaelri).
    _Information_EN=Displays upcoming events from your Google or iCloud Calendars.    This skin is an adapted modification of the original patch by eclectic-tech (based on Enigma GCal by Kaelri).


    ThemeDark_RU=Тёмная
    ThemeDark_EN=Dark
    ThemeLight_RU=Светлая
    ThemeLight_EN=Light

    Str_Theme_RU=Тема оформления:  [#Theme[#Theme]_[#Language]] 
    Str_Theme_EN=Theme: #Theme#

    Str_Event_RU=| Событие
    Str_Event_EN=| Event


    Str_Embedded_RU=| Встроенный цвет
    Str_Embedded_EN=| Embedded color

    Str_EventFaded_RU=Прошедшее
    Str_EventFaded_EN=Past

    Str_Cal_1_Event_Tooltips_RU=Цвет текста События для 1-го календаря
    Str_Cal_1_Event_Tooltips_EN=Color of Event text for the 1st calendar
    Str_Cal_2_Event_Tooltips_RU=Цвет текста События для 2-го календаря
    Str_Cal_2_Event_Tooltips_EN=Color of Event text for the 2st calendar
    Str_Cal_3_Event_Tooltips_RU=Цвет текста События для 3-го календаря
    Str_Cal_3_Event_Tooltips_EN=Color of Event text for the 3st calendar
    Str_Cal_4_Event_Tooltips_RU=Цвет текста События для 4-го календаря
    Str_Cal_4_Event_Tooltips_EN=Color of Event text for the 4st calendar
    Str_Cal_5_Event_Tooltips_RU=Цвет текста События для 5-го календаря
    Str_Cal_5_Event_Tooltips_EN=Color of Event text for the 5st calendar

    Str_Embedded_Tooltips_RU=Поддержка встроенного цвета события (вкл/выкл)
    Str_Embedded_Tooltips_EN=Support for embedded event color (on/off)


    Str_HourLine_RU=Линия часа
    Str_HourLine_EN=Hour line

    Str_HalfHourLine_RU=Линия получаса
    Str_HalfHourLine_EN=Half-hour line


    Str_HeaderLine_RU=Линия заголовка
    Str_HeaderLine_EN=Header line

    Str_VerticalLines_RU=Вертикальные линии
    Str_VerticalLines_EN=HeadVerticaler line


    Str_Header_RU=Заголовок
    Str_Header_EN=Header

    Str_HeaderWeekend_RU=Выходные
    Str_HeaderWeekend_EN=Weekend


    Str_TimeLabels_RU=Время
    Str_TimeLabels_EN=Time

    Str_CurrentTime_RU=Текущее время
    Str_CurrentTime_EN=Current time


    Str_Separator1_RU=Разделитель 1
    Str_Separator1_EN=Separator 1

    Str_Separator2_RU=Разделитель 2
    Str_Separator2_EN=Separator 2


    Str_TimeZone1_RU=Зона времени 1
    Str_TimeZone1_EN=Time Zone 1
    Str_TimeZone1_Tooltips_RU=Цвет для 'Зона времени 1'
    Str_TimeZone1_Tooltips_EN=Color for 'Time Zone 1'

    Str_TimeZone2_RU=Зона времени 2
    Str_TimeZone2_EN=Time Zone 2
    Str_TimeZone2_Tooltips_RU=Цвет для 'Зона времени 2'
    Str_TimeZone2_Tooltips_EN=Color for 'Time Zone 2'


    Str_TimeZone3_RU=Зона времени 3
    Str_TimeZone3_EN=Time Zone 3
    Str_TimeZone3_Tooltips_RU=Цвет для 'Зона времени 3'
    Str_TimeZone3_Tooltips_EN=Color for 'Time Zone 3'

    Str_GridBackground_RU=ФОН 
    Str_GridBackground_EN=BACKGROUND
    Str_GridBackground_Tooltips_RU=Основной фон скина
    Str_GridBackground_Tooltips_EN=Main background of the skin

    Str_ResetThemeButton_Tooltips_RU=Сбросить тему оформления к настройкам по умолчанию
    Str_ResetThemeButton_Tooltips_EN=Reset theme to default settings

;—— ТЕМА ОФОРМЛЕНИЯ (Theme) ————————————————————————————————————————————————————————————————————————
    ; Выбор темы оформления (Theme choice)
    ; Варианты (Options): Dark, Light
    Theme=Dark


;—— ЗАГОЛОВКИ (Title) ——————————————————————————————————————————————————————————————————————
    ; Дата в Сегодня (Date in Today):
    ; Варианты (Options): 1, 0
    DateinToday=0
    DateinToday2=1

;—— РЕЖИМЫ ОТОБРАЖЕНИЯ (Display modes) —————————————————————————————————————————————————————————————
    ; TODO 
    ; Варианты (Options): 1-14
    DisplayedDays=3
    
    ; ; Минимальный режим ВКЛ/ВЫКЛ (SmallMode ON/OFF):
    ;     ; Варианты (Options): 1, 0
    ;     SmallMode=1
    ;     ; Количество дней в SmallMode (Number of days in SmallMode):
    ;     ; Варианты (Options): 1, 2, 3, ... макс:7
    ;     SmallModeDays=3

    ; ; Расширенный режим ВКЛ/ВЫКЛ (LagreMode ON/OFF):
    ;     ; Варианты (Options): 1, 0
    ;     LagreMode=0
    ;     ; Количество дней в LagreMode (Number of days in LagreMode):
    ;     ; Варианты (Options): 1, 2, 3, ... макс:14
    ;     LagreModeDays=10

;—— СЕТКА ВРЕМЕНИ (Time grid) ——————————————————————————————————————————————————————————————————————
    ; Выделить "Сегодня" (Highlight "Today"):
    ; Варианты (Options): 1-да(on), 0-нет(off)
    HighlightToday=0

    ; Ширина блока СЕГОДНЯ календаря в пикселях (Width of TODAY calendar block in pixels):
    ; Переменная BlockWidth_0 обновляется автоматически и зависит от todayHighlightWidth (см. ниже) (The variable BlockWidth_0 is updated automatically and depends on todayHighlightWidth (see below))
    BlockWidth_0=150
    ; На сколько шире столбик Сегодня относительно остальных (How much wider the Today column is compared to the others):
    todayHighlightWidth=50

    ; Ширина одного блока (дня) календаря в пикселях (Width of one calendar block(day) in pixels):
    BlockWidth=100

    ; Ширина всей сетки (3 календаря) в пикселях (Width of the entire grid (3 calendars) in pixels):
    ; НЕ МЕНЯТЬ ВРУЧНУЮ! (DO NOT CHANGE MANUALLY!)
    LineWidth=(#BlockWidth_0#+(#BlockWidth#*(#DisplayedDays#-1)))

    ; С какого часа начинаются СУТКИ в `психологическом` режиме (From which hour the DAY starts in `psychological` mode):
    ; В `стандартном` режиме сутки всегда 00:00-00:00 (In `normal` mode, the day is always 00:00-00:00)
    ; В `пси` режиме сутки начинаются с этого часа (In `psychological` mode, the day starts from this hour)
    ; Если не задано, используется startHour (If not set, startHour is used)
    ; Формат (Format): 0-23
    DayStartHour=5

    ; С какого часа строить сетку времени (From which hour to build the time grid):
    startHour=9
    ; По какой час строить сетку (до какого часа) (Until which hour to build the grid (up to which hour)):
    endHour=4

    ; Отступ слева для сетки времени (Left margin for the time grid):
    LeftMargin=45

    ;  Отступ слева для подписей времени (Left margin for time labels):
    LeftMarginTxt=10

    ; Отступ слева для сетки времени (Left margin for the time grid):
    LeftMargin=#LeftMarginTxt#+10

    ;  Высота заголовка с днями недели в пикселях (Height of the header with days of the week in pixels):
    StepGrid_0=35

    ; Размер шрифта для заголовка с днями недели (Font size for the header with days of the week):
    FontSizeTitle=10

    ; Размер шрифта для подписей времени (Font size for time labels):
    GridHourFontSize=8

    ; Высота одного получаса в пикселях (Height of one half-hour in pixels):
    StepGrid=17

    ; толшина вертикальной линии перед понедельником (thickness of the vertical line before Monday):
    VerticalLine_Monday_Width=2

    ; Боковая Правая вертикальная линия. Видимость (Right side vertical line. Visibility):
    ; Варианты (Options): 1-вкл(on), 0-выкл(off)
    VerticalLine_End_Hidden=1



;—— ФОН ДЛЯ ДНЕВНОГО ВРЕМЕНИ TimeZone_1 В СУТКАХ (Background for daytime hours TimeZone_1) ———————————————————————————————
    ; Включить выделение TimeZone_1 в сутках (Enable highlighting of TimeZone_1 hours):
    ; Варианты (Options): 1, 0
    TimeZone_1=1
    ; С какого часа начинать выделение TimeZone_1 времени в сутках (From which hour to start highlighting daytime hours):
    ; Формат (Format): Ч (H); 0Ч (0H); ЧЧ (HH); ЧЧ:ММ (HH:MM); ЧЧ,ММ (HH,MM); ЧЧ.ММ (HH.MM); ЧЧ-ММ (HH-MM);
    TimeZone_1_Start=11
    TimeZone_1_End=18

    ;—— ФОН ДЛЯ ДНЕВНОГО ВРЕМЕНИ TimeZone_2 В СУТКАХ (Background for daytime hours TimeZone_2) ———————————————————————————————
    ; Включить выделение TimeZone_2 в сутках (Enable highlighting of TimeZone_2 hours):
    ; Варианты (Options): 1, 0
    TimeZone_2=1
    ; С какого часа начинать выделение TimeZone_2 времени в сутках (From which hour to start highlighting daytime hours):
    ; Формат (Format): Ч (H); 0Ч (0H); ЧЧ (HH); ЧЧ:ММ (HH:MM); ЧЧ,ММ (HH,MM); ЧЧ.ММ (HH.MM); ЧЧ-ММ (HH-MM);
    TimeZone_2_Start=18
    TimeZone_2_End=21

    ;—— ФОН ДЛЯ ДНЕВНОГО ВРЕМЕНИ TimeZone_3 В СУТКАХ (Background for daytime hours TimeZone_3) ———————————————————————————————
    ; Включить выделение TimeZone_3 в сутках (Enable highlighting of TimeZone_3 hours):
    ; Варианты (Options): 1, 0
    TimeZone_3=1
    ; С какого часа начинать выделение TimeZone_2 времени в сутках (From which hour to start highlighting daytime hours):
    ; Формат (Format): Ч (H); 0Ч (0H); ЧЧ (HH); ЧЧ:ММ (HH:MM); ЧЧ,ММ (HH,MM); ЧЧ.ММ (HH.MM); ЧЧ-ММ (HH-MM);
    TimeZone_3_Start=22
    TimeZone_3_End=3

; —— РАЗДЕЛИТЕЛИ (Separators) ——————————————————————————————————————————————————————————————————————
    ; Разделитель 1 Показать/скрыть (Show/hide Separator 1)
    ; Варианты (Options): 1-Показать, 0-скрыть (1-Show, 0-Hide)
    Separator_1=1
    ; Толщина разделителя 1 (Separator 1 thickness):
    Separator_1_Weight=3
    ; Время для разделителя 1 (Time for Separator 1):
    Separator_1_Time=12

    ; Разделитель 2 Показать/скрыть (Show/hide Separator 2)
    ; Варианты (Options): 1-Показать, 0-скрыть (1-Show, 0-Hide)
    Separator_2=1
    ; Толщина разделителя 2 (Separator 2 thickness):
    Separator_2_Weight=4
    ; Время для разделителя 2 (Time for Separator 2):
    Separator_2_Time=0


; ВЫХОДНЫЕ (Weekend) ————————————————————————————————————————————————————————————————————————————————
    ; Выделить выходные (Highlight weekend):
    ; Варианты (Options): 1-выделить(Highlight), 0-не выделять(No highlight)
    Weekend_Sun=1
    Weekend_Mon=0
    Weekend_Tue=0
    Weekend_Wed=0
    Weekend_Thu=0
    Weekend_Fri=0
    Weekend_Sat=1
    ; Выделить заголовок (Highlight header)
    Weekend_HighlightHeader=0
    ; Выделить подзаголовок (Highlight subheader)
    Weekend_HighlightSubHeader=1
    ; Толщина шрифта для подзаголовков выходных (Font weight for weekend subheaders):
    FontWeight_SubHeader=600
    Weekend_FontWeight_HighlightSubHeader=900


; —— ПОДДЕРЖКА ВСТРОЕНННОГО ЦВЕТА ФОНА СОБЫТИЯ ИЗ ВНЕШНЕГО ИСТОЧНИКА (Apply embedded background color for event from external source) ———————————————
    ;(некоторые программы поддерживают синхронизацию кастомного цвета события, например WeecCal, передают его в поле "Заметки" или DESCRIPTION:[!FFFFC0!]) 
    ;((some programs support syncing custom event color, e.g. WeecCal, pass it in the "Notes" field or DESCRIPTION:[!FFFFC0!]))
    ; Варианты (Options): 1, 0
    applyEmbeddedBGcolorCal_1=1
    applyEmbeddedBGcolorCal_2=1
    applyEmbeddedBGcolorCal_3=1
    applyEmbeddedBGcolorCal_4=0
    applyEmbeddedBGcolorCal_5=0




;—— СОБЫТИЕ (Event) ————————————————————————————————————————————————————————————————————————————————
    ; Внешний вид события (Event appearance):
    ; Размер шрифта для событий (Font size for events):
    ; (только целые числа) (only integers)
    FontSizeEvent=8
    ; Толщина шрифта для событий (Font weight for events):
    FontWeightEvens=600
    ; Шрифт для событий (Font for events):
    FontName=Montserrat
    FontUnicode=Arial
    
    ; Отступы текста внутри события (Text padding inside event):
    ; Верхний отступ текста от края события (Top padding of text from event edge):
    EventTextPaddingTop=3
    ; Левый отступ текста от края события (Left padding of text from event edge):
    EventTextPaddingLeft=4
    ; Правый отступ текста от края события (Right padding of text from event edge):
    EventTextPaddingRight=3
    ; Нижний отступ текста от края события (Bottom padding of text from event edge):
    EventTextPaddingBottom=2

    ; Unicode символ повторяющегося события (Unicode symbol for recurring event):
    ; ↶ ↷ ↺ ↻ ⟲ ⟳ ♻ ⤺ ⤻ ⤼ ⤽ ⤾ ⤿ ⥀ ⥁ ⌘ ⇄ ⇅ ⇆ ⥂ ⥃ ⥄ ⥅ ๑ ஐ ⊶ ⊷
    RepeatEventIcon=↻

    ; Приглушенный цвет для событий ЗАВТРА и далее (Muted color for events for tomorrow and beyond):
    ; Варианты (Options): 0-выкл(off) 1-вкл rgb→A(on rgb→A), 2-вкл hS→L(on hS→L),
    MutedFutureEvents=0
    ; Прозрачность приглушенного цвета для событий ЗАВТРА и далее (Transparency of the muted color for events for tomorrow and beyond):
    ; На сколько цвет будет более прозрачным (How much more transparent the color will be):
        ; →A:(0-255) 0 - полностью прозрачно (completely transparent), 255 - непрозрачно (opaque)
        ; рекомендуется от 10 до 90 (recommended from 10 to 90)
        Muted_rgbA=80
        ; →L: в % (0-100) на сколько % уменьшить яркость и насыщенность (by what % to reduce brightness and saturation)
        ; рекомендуется от 10 до 50 (recommended from 10 to 50)
        Muted_hSL=35

;—— ПУТЬ К ПОЧТОВОМУ КЛИЕНТУ (Path to mail client) —————————————————————————————————————————————————————————————
    ; для открытия Календаря при клике на событие для управления событиями (to open the Calendar for managing events):
    ; Укажите путь к вашему почтовому клиенту (Specify the path to your mail
    CalendarClient="C:\Program Files (x86)\eM Client\MailClient.exe"

;—— КНОПКИ КАЛЕНДАРЕЙ слева вверху сетки (Calendar buttons at the top left of the grid) ————————————
    EllipseRad1=3
    EllipseRad2=3
    EllipseRad3=3
    EllipseRad4=3
    EllipseScale=2
    Rectangle5W=17
    Rectangle5H=6
    RectangleScale=2
    Cal_5_OffsetX=7
    Cal_5_OffsetY=-3


;—— КНОПКА НАСТРОЕК (Settings button) —————————————————————————————————————————————————————————————
    SettingsFontFace=Font Awesome 7 Free Solid
    SettingsHidden=0
    SettingsOnHidden=1
    Settings_Txt_RU=Настройки |  Обновить
    Settings_Txt_EN=Settings |  Refresh
    Theme_Txt_RU=Сменить тему |  Настроить
    Theme_Txt_EN=Change theme |  Customize
    ; Таймаут автоматического отключения режима настроек в секундах (Settings mode auto-disable timeout in seconds)
    SettingsTimeoutSeconds=60

    MeLink="https://github.com/Dokcc"

    ; Размер панели настроек (Settings panel size):
    SettingsPanel_W=186
    SettingsPanel_H=395
    ; Положение текста в панели настроек (Text position in the settings panel):
    SettingsPanel_txt_X=(#LeftMargin#+#LineWidth#-#SettingsPanel_W#)


;—— DEBUG Mode —————————————————————————————————————————————————————————————————————————————————————
    ; Записывать отладочную информацию в файл CalendarGRID_dump.txt (Write debug information to CalendarGRID_dump.txt)
    ; записывать отладочную информацию в файл CalendarEvents_dump.txt (Write debug information to CalendarEvents_dump.txt)
    ; Варианты (Options): 1-вкл(on), 0-выкл(off)
    DebugMode=1

; ▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆
;—— АВТОМАТИЧЕСКОЕ ОБНОВЛЕНИЕ ПЕРЕМЕННЫХ (Automatic variable update) ▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂
;—— НЕ МЕНЯТЬ ВРУЧНУЮ! (DO NOT CHANGE MANUALLY!) ▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂
    ; Высота фона для подсказки скрытого события (Height of the background for the hidden event tooltip):
        HiddenEventBGHeight=20
    
    ; Цвета для кнопок календарей (Colors for calendars buttons):
        Cal_1_FillColor=33,150,243,255
        Cal_1_StrokColor=33,150,243
        Cal_2_FillColor=86,218,172,255
        Cal_2_StrokColor=86,218,172
        Cal_3_FillColor=133,50,243,255
        Cal_3_StrokColor=133,50,243
        Cal_4_FillColor=150,150,150,255
        Cal_4_StrokColor=150,150,150
        Cal_5_FillColor=150,150,150,1
        Cal_5_StrokColor=150,150,150

    ;—— Текущее время (Current time) —————————————————————————————————————————————————————
        ; Отображать текущее время (Show current time):
        ; Варианты (Options): 1, 0
        CurentTimeTypeRight=0
        CurentTimeTypeLeft=0
        CurentTimeHidden=1
        ; Адаптировать цвет фона линии текущего времени под цвет фона расположенных под ним объектов 
        ; (Adapt the background color of the current time line to the background color of the objects located under it): 
        ; Варианты (Options): 1, 0
        CurentTimeColorBgAdaptive=1
        ; TODO-75 !WriteKeyValue сделать 1 раз в мин или убрать запись вообще тк это динамич переменная и достат !SetVariable
        CurentTimeColorBg=36,36,36
        ; OmniCal_Skin.lua : Toggle_CurentTimeTypeRight(),Toggle_CurentTimeTypeLeft()
        CurentTimeShape2=Rectangle 34r,0,38,32 | Fill RadialGradient Time_CurrTimeBGGradient1 | StrokeWidth 0 | Stroke Color 0,0,0,0
    
    
    ;—— MutedFutureEvents временная переменная
        MutedFutureEvents_temp=2
    ;—— MeasureActive временная переменная
        OmniCalColorActive=0
    
    ;—— Координаты основного фона скина (устанавливаются скриптом) (Main skin background coordinates, set by script)
        MeterBg_W=395
        MeterBg_H=681
    ;—— Координаты фона TimeZone_1 (устанавливаются скриптом) (TimeZone_1 background coordinates, set by script)
        MeterDayBg_Y=103
        MeterDayBg_H=238
    ;—— Координаты фона TimeZone_2 (устанавливаются скриптом) (TimeZone_2 background coordinates, set by script)
        MeterDayBg2_Y=341
        MeterDayBg2_H=102
    ;—— Координаты фона TimeZone_3 (устанавливаются скриптом) (TimeZone_3 background coordinates, set by script)
        MeterDayBg3_Y=477
        MeterDayBg3_H=170
    
    LUApaused=0
